Miles0sage/zigblade/firmware/sdkconfig.defaults
# -------------------------------------------------
# ZigBlade sdkconfig.defaults — ESP32-H2
# -------------------------------------------------

# Target
CONFIG_IDF_TARGET="esp32h2"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_48M=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# IEEE 802.15.4
CONFIG_IEEE802154_ENABLED=y
CONFIG_IEEE802154_RX_BUFFER_SIZE=20

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# SPI
CONFIG_SPI_MASTER_IN_IRAM=y

# I2C
# (I2C is enabled by default via driver component)

# SD card — SPI mode
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# Hardware crypto accelerator
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Optimisation
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Enable LED strip RMT backend (WS2812B)
CONFIG_LED_STRIP_BACKEND_RMT=y
